'2019_11_30_Koichi_Shimazu'
Imports System.Data
Imports System.Data.SqlClient

Public Class frm精算処理

    ''データベース接続用-------------------------------
    Private msSQL As String
    Private mCommand As SqlCommand
    Private mSDA As New SqlDataAdapter

    ''入力対象のテキストボックスを指定-------------------------------
    Private ctlTarget As TextBox

    Private Sub frm会計集計表vb_Load(sender As Object, e As EventArgs) Handles MyBase.Load
        '印刷ボタンを非アクティブに変更
        btnレシート印刷.Enabled = False

    End Sub

    Private Sub btn集計_Click(sender As Object, e As EventArgs) Handles btn集計.Click

        Dim int金額計算用 As Integer = 0

        ''釣銭準備金（「金額」項目で「表示名」項目が「釣銭準備金」の合計）-------------------------------
        Call 検索結果表示("COUNT(金額) AS 釣備件数", "Dレジ取引_未精算", "表示名 = '釣銭準備金'", "釣備件数", txt釣銭準備金_件数)
        Call 検索結果表示("SUM(金額) AS 釣備合計", "Dレジ取引_未精算", "表示名 = '釣銭準備金'", "釣備合計", txt釣銭準備金_金額)

        ''現金預かり（「金額」項目で「表示名」項目が「お預り」の合計）-------------------------------
        Call 検索結果表示("COUNT(金額) AS 現預件数", "Dレジ取引_未精算", "表示名 = 'お預り'", "現預件数", txt現金預かり_件数)
        Call 検索結果表示("SUM(金額) AS 現預金額", "Dレジ取引_未精算", "表示名 = 'お預り'", "現預金額", txt現金預かり_金額)

        ''釣銭支払い（「金額」項目で「表示名」項目が「お釣り」の合計）-------------------------------
        Call 検索結果表示("COUNT(金額) AS 釣支件数", "Dレジ取引_未精算", "表示名 = 'お釣り'", "釣支件数", txt釣銭支払い_件数)
        Call 検索結果表示("SUM(金額) AS 釣支金額", "Dレジ取引_未精算", "表示名 = 'お釣り'", "釣支金額", txt釣銭支払い_金額)

        ''★集計内容が不明-------------------------------
        Call 検索結果表示("COUNT(金額) AS 入金件数", "Dレジ取引_未精算", "表示名 = '入金'", "入金件数", txt入金_件数)
        Call 検索結果表示("SUM(金額) AS 入金金額", "Dレジ取引_未精算", "表示名 = '入金'", "入金金額", txt入金_金額)

        ''釣銭回収（「金額」項目で「明細区分」項目が「902」かつ「機能CD」項目が「451」の合計）-------------------------------
        Call 検索結果表示("COUNT(金額) AS 釣回件数", "Dレジ取引_未精算", "明細区分 = '902' AND 機能CD = '451'", "釣回件数", txt釣銭回収_件数)
        Call 検索結果表示("SUM(金額) AS 釣回金額", "Dレジ取引_未精算", "明細区分 = '902' AND 機能CD = '451'", "釣回金額", txt釣銭回収_金額)

        ''★集計内容が不明-------------------------------
        Call 検索結果表示("COUNT(金額) AS 出金件数", "Dレジ取引_未精算", "表示名 = '　'", "出金件数", txt出金_件数)
        Call 検索結果表示("SUM(金額) AS 出金金額", "Dレジ取引_未精算", "表示名 = '　'", "出金金額", txt出金_金額)

        ''★(計算方法が不明。「現金外」での売り上げの扱いは？)txt現金有り高（レジ内の現金＝「釣銭準備金」+「現金預かり」-「釣銭支払い」+「入金」-「釣銭回収」-「出金」）の合計-------------------------------
        If txt釣銭準備金_金額.Text <> "" Then int金額計算用 = Integer.Parse(txt釣銭準備金_金額.Text, Globalization.NumberStyles.Any)
        If txt現金預かり_金額.Text <> "" Then int金額計算用 = int金額計算用 + Integer.Parse(txt現金預かり_金額.Text, Globalization.NumberStyles.Any)
        If txt釣銭支払い_金額.Text <> "" Then int金額計算用 = int金額計算用 - Integer.Parse(txt釣銭支払い_金額.Text, Globalization.NumberStyles.Any)
        If txt入金_金額.Text <> "" Then int金額計算用 = int金額計算用 + Integer.Parse(txt入金_金額.Text, Globalization.NumberStyles.Any)
        If txt釣銭回収_金額.Text <> "" Then int金額計算用 = int金額計算用 - Integer.Parse(txt釣銭回収_金額.Text, Globalization.NumberStyles.Any)
        If txt出金_金額.Text <> "" Then int金額計算用 = int金額計算用 - Integer.Parse(txt出金_金額.Text, Globalization.NumberStyles.Any)
        txt現金有り高.Text = int金額計算用.ToString("#,0")

        ''★集計内容が不明-------------------------------
        Call 検索結果表示("COUNT(金額) AS 現計件数", "Dレジ取引_未精算", "表示名 = '　'", "現計件数", txt現計_件数)
        Call 検索結果表示("SUM(金額) AS 現計金額", "Dレジ取引_未精算", "表示名 = '　'", "現計金額", txt現計_金額)

        ''★集計内容が不明-------------------------------
        Call 検索結果表示("COUNT(金額) AS 信１件数", "Dレジ取引_未精算", "表示名 = '　'", "信１件数", txt信計1_件数)
        Call 検索結果表示("SUM(金額) AS 信１金額", "Dレジ取引_未精算", "表示名 = '　'", "信１金額", txt信計1_金額)

        ''★集計内容が不明-------------------------------
        Call 検索結果表示("COUNT(金額) AS 信２件数", "Dレジ取引_未精算", "表示名 = '　'", "信２件数", txt信計2_件数)
        Call 検索結果表示("SUM(金額) AS 信２金額", "Dレジ取引_未精算", "表示名 = '　'", "信２金額", txt信計2_金額)

        ''★集計内容が不明-------------------------------
        Call 検索結果表示("COUNT(金額) AS 信３件数", "Dレジ取引_未精算", "表示名 = '　'", "信３件数", txt信計3_件数)
        Call 検索結果表示("SUM(金額) AS 信３金額", "Dレジ取引_未精算", "表示名 = '　'", "信３金額", txt信計3_金額)

        ''★集計内容が不明-------------------------------
        Call 検索結果表示("COUNT(金額) AS 信４件数", "Dレジ取引_未精算", "表示名 = '　'", "信４件数", txt信計4_件数)
        Call 検索結果表示("SUM(金額) AS 信４金額", "Dレジ取引_未精算", "表示名 = '　'", "信４金額", txt信計4_金額)

        ''★集計内容が不明-------------------------------
        Call 検索結果表示("COUNT(金額) AS 計有件数", "Dレジ取引_未精算", "表示名 = '　'", "計有件数", txtII計釣有_件数)
        Call 検索結果表示("SUM(金額) AS 計有金額", "Dレジ取引_未精算", "表示名 = '　'", "計有金額", txtII計釣有_金額)

        ''★集計内容が不明-------------------------------
        Call 検索結果表示("COUNT(金額) AS 計無件数", "Dレジ取引_未精算", "表示名 = '　'", "計無件数", txtII計釣無_件数)
        Call 検索結果表示("SUM(金額) AS 計無金額", "Dレジ取引_未精算", "表示名 = '　'", "計無金額", txtII計釣無_金額)

        ''★集計内容が不明-------------------------------
        Call 検索結果表示("COUNT(金額) AS 計ク件数", "Dレジ取引_未精算", "表示名 = '　'", "計ク件数", txtII計クーポン_件数)
        Call 検索結果表示("SUM(金額) AS 計ク金額", "Dレジ取引_未精算", "表示名 = '　'", "計ク金額", txtII計クーポン_金額)

        ''★集計内容が不明-------------------------------
        Call 検索結果表示("COUNT(金額) AS 貸計件数", "Dレジ取引_未精算", "表示名 = '　'", "貸計件数", txt貸計_件数)
        Call 検索結果表示("SUM(金額) AS 貸計金額", "Dレジ取引_未精算", "表示名 = '　'", "貸計金額", txt貸計_金額)

        ''現金外計（「金額」項目で「明細区分」項目が「750（クレジット等）」の合計）-------------------------------
        Call 検索結果表示("SUM(金額) AS 現金外計", "Dレジ取引_未精算", "明細区分 = '750'", "現金外計", txt現金外計)

        ''過不足金（「現金有り高」をマイナスにして「現金外計」と金種表の総額を足す）-------------------------------
        int金額計算用 = 0
        If txt現金有り高.Text <> "" Then int金額計算用 = Integer.Parse(txt現金有り高.Text, Globalization.NumberStyles.Any)
        If txt現金有り高.Text <> "" Then int金額計算用 = 0 - int金額計算用
        If txt現金外計.Text <> "" Then int金額計算用 = int金額計算用 + Integer.Parse(txt現金外計.Text, Globalization.NumberStyles.Any)
        txt過不足金.Text = int金額計算用.ToString("#,0")

        ''★純売上額（「金額」項目で「明細区分」項目が「600」の合計）の集計（集計方法が不明）-------------------------------
        Call 検索結果表示("SUM(金額) AS 純売上額", "Dレジ取引_未精算", "明細区分 = '600'", "純売上額", txt純売上額)

        ''★雑収入（「金額」項目で「明細区分」項目が「600」の合計）の集計（集計方法が不明）-------------------------------
        Call 検索結果表示("SUM(金額) AS 雑収入", "Dレジ取引_未精算", "明細区分 = '600'", "雑収入", txt雑収入)

        ''8％10％と軽減税率の集計を分ける-------------------------------
        ''内消費税（「金額」項目で「明細区分」項目が「999」かつ「課税区分」項目が「3」か、「明細区分」項目が「999」かつ「課税区分」項目が「5」の合計）の集計-------------------------------
        Call 検索結果表示("SUM(金額) AS 内消費税", "Dレジ取引_未精算", "明細区分 = '999' AND 課税区分 = '3' OR 明細区分 = '999' AND 課税区分 = '5'", "内消費税", txt内消費税)

        ''内軽減消費税（「金額」項目で「明細区分」項目が「999」かつ「課税区分」項目が「7」の合計）の集計-------------------------------
        Call 検索結果表示("SUM(金額) AS 内減費税", "Dレジ取引_未精算", "明細区分 = '999' AND 課税区分 = '7'", "内減費税", txt内軽減消費税)

        ''外消費税（「金額」項目で「明細区分」項目が「999」かつ「課税区分」項目が「4」か、「明細区分」項目が「999」かつ「課税区分」項目が「6」の合計）の集計-------------------------------
        Call 検索結果表示("SUM(金額) AS 外消費税", "Dレジ取引_未精算", "明細区分 = '999' AND 課税区分 = '4' OR 明細区分 = '999' AND 課税区分 = '6'", "外消費税", txt外消費税)

        ''外軽減消費税（「金額」項目で「明細区分」項目が「999」かつ「課税区分」項目が「8」の合計）の集計-------------------------------
        Call 検索結果表示("SUM(金額) AS 外減費税", "Dレジ取引_未精算", "明細区分 = '999' AND 課税区分 = '8'", "外減費税", txt外軽減消費税)

        ''★税抜売上の集計(たぶん純売上額から税金分を抜いた額。雑収入は考慮しない？)-------------------------------
        int金額計算用 = Integer.Parse(txt純売上額.Text, Globalization.NumberStyles.Any)
        If txt内消費税.Text <> "" Then int金額計算用 = int金額計算用 - Integer.Parse(txt内消費税.Text, Globalization.NumberStyles.Any)
        If txt内軽減消費税.Text <> "" Then int金額計算用 = int金額計算用 - Integer.Parse(txt内軽減消費税.Text, Globalization.NumberStyles.Any)
        If txt外消費税.Text <> "" Then int金額計算用 = int金額計算用 - Integer.Parse(txt外消費税.Text, Globalization.NumberStyles.Any)
        If txt外軽減消費税.Text <> "" Then int金額計算用 = int金額計算用 - Integer.Parse(txt外軽減消費税.Text, Globalization.NumberStyles.Any)
        txt税抜売上額.Text = int金額計算用.ToString("#,0")

        ''★訂正（「金額」項目で「登録区分」項目が「訂正」かつ「明細区分」項目が「600」の合計）集計方法が不明-------------------------------
        Call 検索結果表示("COUNT(金額) AS 訂正件数", "Dレジ取引_未精算", "登録区分 = '訂正' AND 明細区分 = '600'", "訂正件数", txt訂正_件数)
        Call 検索結果表示("SUM(金額) AS 訂正金額", "Dレジ取引_未精算", "登録区分 = '訂正' AND 明細区分 = '600'", "訂正金額", txt訂正_金額)

        ''★返品（「金額」項目で「明細区分」項目が「200」の合計）集計方法が不明-------------------------------
        Call 検索結果表示("COUNT(金額) AS 返品件数", "Dレジ取引_未精算", "明細区分 = '200'", "返品件数", txt返品_件数)
        Call 検索結果表示("SUM(金額) AS 返品金額", "Dレジ取引_未精算", "明細区分 = '200'", "返品金額", txt返品_金額)

        ''★明細値引（「明細値引金額」項目で「明細区分」項目が「600」の合計）値引きと割引の集計方法の違いが不明-------------------------------
        Call 検索結果表示("COUNT(明細値引金額) AS 明細値引件数", "Dレジ取引_未精算", "明細区分 = '600'", "明細値引件数", txt明細値引_件数)
        Call 検索結果表示("SUM(明細値引金額) AS 明細値引金額", "Dレジ取引_未精算", "明細区分 = '600'", "明細値引金額", txt明細値引_金額)

        ''★明細割引（「？？？」項目で「明細区分」項目が「600」の合計）値引きと割引の集計方法の違いが不明-------------------------------
        Call 検索結果表示("COUNT(金額) AS 明細割引件数", "Dレジ取引_未精算", "明細区分 = '0'", "明細割引件数", txt明細割引_件数)
        Call 検索結果表示("SUM(金額) AS 明細割引金額", "Dレジ取引_未精算", "明細区分 = '0'", "明細割引金額", txt明細割引_金額)

        ''★小計値引（「小計値引金額」項目で「明細区分」項目が「600」の合計）値引きと割引の集計方法の違いが不明-------------------------------
        Call 検索結果表示("COUNT(小計値引金額) AS 小計値引件数", "Dレジ取引_未精算", "明細区分 = '600'", "小計値引件数", txt小計値引_件数)
        Call 検索結果表示("SUM(小計値引金額) AS 小計値引金額", "Dレジ取引_未精算", "明細区分 = '600'", "小計値引金額", txt小計値引_金額)

        ''★小計割引（「？？？」項目で「明細区分」項目が「600」の合計）値引きと割引の集計方法の違いが不明-------------------------------
        Call 検索結果表示("COUNT(金額) AS 小計割引件数", "Dレジ取引_未精算", "明細区分 = '0'", "小計割引件数", txt小計割引_件数)
        Call 検索結果表示("SUM(金額) AS 小計割引金額", "Dレジ取引_未精算", "明細区分 = '0'", "小計割引金額", txt小計割引_金額)

        ''★単品値引（「単品値引金額」項目で「明細区分」項目が「600」の合計）値引きと割引の集計方法の違いが不明-------------------------------
        Call 検索結果表示("COUNT(単品値引金額) AS 単品値引件数", "Dレジ取引_未精算", "明細区分 = '600'", "単品値引件数", txt単品値引_件数)
        Call 検索結果表示("SUM(単品値引金額) AS 単品値引金額", "Dレジ取引_未精算", "明細区分 = '600'", "単品値引金額", txt単品値引_金額)

        ''★ハンドル値引（「バンドル値引金額」項目で「明細区分」項目が「600」の合計）値引きと割引の集計方法の違いが不明-------------------------------
        Call 検索結果表示("COUNT(バンドル値引金額) AS ハン値引件数", "Dレジ取引_未精算", "明細区分 = '600'", "ハン値引件数", txtハンドル値引_件数)
        Call 検索結果表示("SUM(バンドル値引金額) AS ハン値引金額", "Dレジ取引_未精算", "明細区分 = '600'", "ハン値引金額", txtハンドル値引_金額)

        ''★クーポン値引（「クーポン値引金額」項目で「明細区分」項目が「600」の合計）値引きと割引の集計方法の違いが不明-------------------------------
        Call 検索結果表示("COUNT(クーポン値引金額) AS クー値引件数", "Dレジ取引_未精算", "明細区分 = '600'", "クー値引件数", txtクーポン値引_件数)
        Call 検索結果表示("SUM(クーポン値引金額) AS クー値引金額", "Dレジ取引_未精算", "明細区分 = '600'", "クー値引金額", txtクーポン値引_金額)

        ''★総売上額（「金額」項目で「明細区分」項目が「600」の合計）の集計（集計方法が不明）-------------------------------
        Call 検索結果表示("SUM(金額) AS 総売上額", "Dレジ取引_未精算", "明細区分 = '600'", "総売上額", txt総売上額)

        ''クーポン発行（「金額」項目で「明細区分」項目が「910（クーポン発行）」の合計）-------------------------------
        Call 検索結果表示("COUNT(金額) AS クー発行件数", "Dレジ取引_未精算", "明細区分 = '910'", "クー発行件数", txtクーポン発行_件数)
        Call 検索結果表示("SUM(金額) AS クー発行金額", "Dレジ取引_未精算", "明細区分 = '910'", "クー発行金額", txtクーポン発行_金額)

        ''領収書発行（「金額」項目で「明細区分」項目が「998（領収書発行）」かつ「機能CD」が「800」の合計）-------------------------------
        Call 検索結果表示("COUNT(金額) AS 領収発行件数", "Dレジ取引_未精算", "明細区分 = '998' AND 機能CD = '800'", "領収発行件数", txt領収書発行_件数)
        Call 検索結果表示("SUM(金額) AS 領収発行金額", "Dレジ取引_未精算", "明細区分 = '998' AND 機能CD = '800'", "領収発行金額", txt領収書発行_金額)

        ''両替（「金額」項目で「明細区分」項目が「997（両替）」」かつ「機能CD」項目が「801」の合計）-------------------------------
        Call 検索結果表示("COUNT(金額) AS 両替件数", "Dレジ取引_未精算", "明細区分 = '997' AND 機能CD = '801'", "両替件数", txt両替_件数)
        Call 検索結果表示("SUM(金額) AS 両替金額", "Dレジ取引_未精算", "明細区分 = '997' AND 機能CD = '801'", "両替金額", txt両替_金額)

        ''★取引回数の集計方法が不明-------------------------------
        Call 検索結果表示("COUNT(金額) AS 取引回数件数", "Dレジ取引_未精算", "明細区分 = '600'", "取引回数件数", txt取引回数_件数)
        Call 検索結果表示("SUM(金額) AS 取引回数金額", "Dレジ取引_未精算", "明細区分 = '600'", "取引回数金額", txt取引回数_金額)

        ''取引人数（「人数」項目で「明細区分」が「600」の合計）の合計-------------------------------
        Call 検索結果表示("SUM(人数) AS 取引人数件数", "Dレジ取引_未精算", "明細区分 = '600'", "取引人数件数", txt取引人数_件数)
        Call 検索結果表示("SUM(金額) AS 取引人数金額", "Dレジ取引_未精算", "明細区分 = '600'", "取引人数金額", txt取引人数_金額)

        ''★一括と指定の区分が不明-------------------------------
        Call 検索結果表示("COUNT(金額) AS 登一取消件数", "Dレジ取引_未精算", "明細区分 = '0'", "登一取消件数", txt登録一括取消_件数)
        Call 検索結果表示("SUM(金額) AS 登一取消金額", "Dレジ取引_未精算", "明細区分 = '0'", "登一取消金額", txt登録一括取消_金額)
        Call 検索結果表示("COUNT(金額) AS 訂一取消件数", "Dレジ取引_未精算", "明細区分 = '0'", "訂一取消件数", txt訂正一括取消_件数)
        Call 検索結果表示("SUM(金額) AS 訂一取消金額", "Dレジ取引_未精算", "明細区分 = '0'", "訂一取消金額", txt訂正一括取消_金額)
        Call 検索結果表示("COUNT(金額) AS 登指取消件数", "Dレジ取引_未精算", "明細区分 = '0'", "登指取消件数", txt登録指定取消_件数)
        Call 検索結果表示("SUM(金額) AS 登指取消金額", "Dレジ取引_未精算", "明細区分 = '0'", "登指取消金額", txt登録指定取消_金額)
        Call 検索結果表示("COUNT(金額) AS 訂指取消件数", "Dレジ取引_未精算", "明細区分 = '0'", "訂指取消件数", txt訂正指定取消_件数)
        Call 検索結果表示("SUM(金額) AS 訂指取消金額", "Dレジ取引_未精算", "明細区分 = '0'", "訂指取消金額", txt訂正指定取消_金額)

        '印刷ボタンをアクティブに変更
        btnレシート印刷.Enabled = True

    End Sub

    Private Sub btn終了_Click(sender As Object, e As EventArgs) Handles btn終了.Click
        Me.Close()
    End Sub

    Private Sub 検索結果表示(項目名 As String, テーブル名 As String, 条件式 As String, 入力内容 As String, 入力先 As TextBox)

        Dim cDB As New clsDB
        Dim msSQL As String
        Dim myTable As New DataTable

        Dim strTemp As String
        Dim dblTemp As Double

        'データベースから取得したいデータ群をSQLで検索
        msSQL = "SELECT " + 項目名
        msSQL += " FROM "
        msSQL += テーブル名
        msSQL += " WHERE "
        msSQL += 条件式

        mCommand = cDB.getsqlComand(msSQL)
        mSDA.SelectCommand = mCommand

        Call mSDA.Fill(myTable) ''データセット作成


        'SQLで検索したデータ群のレコードを、1レコードずつ取り出す
        For nRowCounter As Integer = 0 To myTable.Rows.Count - 1
            strTemp = "" '次に「部門コンボボックス」に登録する文字列　を　クリア（初期化：長さ０の文字列）する

            '「部門コンボボックス」に登録する文字列データの生成
            strTemp += myTable.Rows(nRowCounter).Item(入力内容).ToString


            If 項目名.Substring(0, 3) = "SUM" Then

                If strTemp <> "" Then
                    dblTemp = Double.Parse(strTemp)
                    strTemp = dblTemp.ToString("#,0")
                End If

            End If

            '生成した文字列を「部門コンボボックス」に登録する
            入力先.Text = strTemp

        Next

        Call cDB.Close()

    End Sub

    Private Sub btnエクスポート_Click(sender As Object, e As EventArgs) Handles btnエクスポート.Click
        Dim sfrm As New frm804会計集計表_エクスポート

        Call sfrm.ShowDialog()

    End Sub
End Class